feat: add C4 model level 1 & 2 by mermaid integrated code
